Tekla Open API Reference for Tekla Structures 2025
Component Constructor (ComponentInput)
 Creates a new component instance with the given component input.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Component(
	ComponentInput I
)
Public Sub New (
	I As ComponentInput
)
Parameters
I
Type: Tekla.Structures.Model.ComponentInput
The component input to be used for the component.
See Also
Reference
Component Class
Component Overload
Tekla.Structures.Model Namespace